app/controllers/productos_controller.rb

SELECT `productos`.* FROM `productos`
---
 def catalogo
@productos = Producto.all

SELECT `productos`.* FROM `productos`
---
  def index
    @productos = Producto.all

SELECT `productos`.* FROM `productos` WHERE `productos`.`id` = 1 LIMIT 1
---
    def set_producto
      @producto = Producto.find(params[:id])